app/controllers/admin/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "测试"], ["description", "夺杯 "], ["quantity", 23], ["price", 2355], ["created_at", 2017-07-05 13:32:40 UTC], ["updated_at", 2017-07-05 13:32:40 UTC]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image", "iphone6.jpg"], ["updated_at", 2017-07-05 14:20:36 UTC], ["id", 1]]