app/views/carts/index.html.erb

      <tbody>
        <% current_cart.cart_items.each do |cart_item| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 2]]

              <%= link_to product_path(cart_item.product) do %>
                <% if cart_item.product.image.present? %>
---
SELECT "products".* FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = ?  [["cart_id", 3]]