app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "2"], ["LIMIT", 1]]
---
  def show
    @order = Order.find_by_token(params[:id])

INSERT INTO "orders" ("total", "user_id", "billing_name", "billing_address", "shipping_name", "shipping_address", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 3]]
SELECT "product_lists".* FROM "product_lists" WHERE "product_lists"."order_id" = ?  [["order_id", 5]]
INSERT INTO "product_lists" ("order_id", "product_name", "product_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["product_name", "Apple iPhone 6 32G 金色"], ["product_price", 2578], ["quantity", 2], ["created_at", "2017-07-06 23:25:59.134743"], ["updated_at", "2017-07-06 23:25:59.134743"]]
---
  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total = current_cart.total_price

    if @order.save
      current_cart.cart_items.each do |cart_item|
        product_list = ProductList.new
        product_list.order = @order
        product_list.product_name = cart_item.product.title
        product_list.product_price = cart_item.product.price
        product_list.quantity = cart_item.quantity
        product_list.save

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "27593032-85ae-4c7c-8c1d-2dfc9a3a3168"], ["LIMIT", 1]]
---
  def pay_with_alipay
    @order = Order.find_by_token(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "d5628102-682e-41f4-b72c-017b165f9131"], ["LIMIT", 1]]
---
  def pay_with_wechat
    @order = Order.find_by_token(params[:id])

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "048265b4-c678-48b4-8f8d-83609a807773"], ["LIMIT", 1]]
---
  def apply_to_cancel
    @order = Order.find_by_token(params[:id])